; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	ZimzuM <zimzumjohn5@hotmail.com
; Homepage:	http://www.legroom.net/mysoft
;
; Fixes Language: Marcio Barbosa <mpg@mpg.com.br>
; Homepage: http://www.mpg.com.br
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Cancelar"
MAIN_DEST_DIR_LABEL = "&Diretуrio de Destino:"
MAIN_FILE_LABEL = "&Arquivo ou Instalador Para Extrair:"
MENU_FILE_LABEL = "Arqui&vo"
MENU_FILE_QUIT_LABEL = "&Sair"
MENU_EDIT_LABEL = "&Editar"
MENU_EDIT_PREFS_LABEL = "&Preferкncias"
MENU_HELP_LABEL = "&Ajuda"
MENU_HELP_WEB_LABEL = "%s &Web Site"
PREFS_TITLE_LABEL = "Preferкncias"
PREFS_UNIEXTRACT_OPTS_LABEL = "Opзхes do Universal Extractor"
PREFS_HISTORY_LABEL = "&Manter o Histуrico de Arquivos"
PREFS_FORMAT_OPTS_LABEL = "Outras Opзхes"
PREFS_LANG_LABEL = "&Lingua"
PREFS_DEBUG_LABEL = "&Diretуrio de Arquivos Depurados:"
PREFS_WARN_EXECUTE_LABEL = "&Avisar Antes de Executar o Arquivo"
PREFS_REMOVE_DUPE_LABEL = "&Remover Arquivos Duplicados"
PREFS_REMOVE_TEMP_LABEL = "Remover Arquivos &Temporбrios"
PREFS_APPEND_EXT_LABEL = "&Tentar Juntar Extensхes Perdidas de Arquivos"
METHOD_ADMIN_RADIO = "%s Instalador Administrativo"
METHOD_EXTRACTION_RADIO = "%s Extraзгo"
METHOD_HEADER = "Extraзгo de %s"
METHOD_MSI_NOTE_LABEL = "Nota:"
METHOD_MSI_REQUIRES_LABEL = "Requer msi2xml"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Mйtodo de Extraзгo"
METHOD_SWITCH_RADIO = "%s comutado"
METHOD_NOTIS_RADIO = "Nгo й um Instalador InstallShield"
METHOD_TEXT_LABEL = "%s Suporta os Seguientes Mйtodos Para Extraзгo %s de Pacotes.  Infelizmente, Nenhum Destes Mйtodos й 100% Confiбvel. Se o Mйtodo Predefinido Nгo Funcionar, Por Favor, Tente Utilizar %s Selecionando um Mйtodo Alternativo."
METHOD_UNPACKER_RADIO = "%s Descompactador"

; GUI control functions
DOES_NOT_EXIST = "Nгo Existe.%n"
EXTRACT_TO = "Extrair em:"
INVALID_DIR_SELECTED =  "%s Nгo й um Diretorio Vбlido."
INVALID_FILE_SELECTED = "%sPor favor, Selecione um Arquivo Vбlido."
OPEN_FILE = "Abrir Arquivo"
SELECT_FILE = "Abrir Arquivo"
WRITE_TO = "Escrever em:"

; Common terms
TERM_ARCHIVE = "Arquivo"
TERM_COMPRESSED = "Arquivo Comprimido"
TERM_DISK = "Disco"
TERM_EBOOK = "Livro Eletrфnico"
TERM_ECARD = "Cartгo Eletrфnico"
TERM_ENCODED = "Arquivo Codificado"
TERM_EXECUTABLE = "Executбvel"
TERM_FAILED = "Erro"
TERM_HELP = "Arquivo de Ajuda"
TERM_HOTFIX = "Revisгo"
TERM_IMAGE = "Imagem"
TERM_INSTALLER = "Instalador"
TERM_PACKAGE = "Pacote"
TERM_PATCH = "Parte"
TERM_SFX = "Auto-executбvel"
TERM_STAGE = "Processo"
TERM_SUCCEEDED = "Realizado"
TERM_TESTING = "Testando"
TERM_UNKNOWN = "Desconhecido"
TERM_UNPACKED = "Descompactado"
TERM_UPDATER = "Atualizador"

; Status messages
SCANNING_FILE = "Analizando para Identificar o Tipo de Arquivo."
SCANNING_EXE = "Analizando Arquivo com %s Escanner."
EXTRACTING = "Extrair Arquivos de:"
INIT_WAIT = "Esperando a Inicializacгo do Instalador.%nPor favor, Espere."

; Custom prompts
CONVERT_CDROM = "A Imagem de CD-ROM BIN/CUE nгo Pode ser Extraнda Automбticamente. Esta Imagem%nSerб Convertida em uma Imagem de CD-ROM ISO, Entгo Poderб ser Extraнda.%n%nDeseja Continuar?%nNota: Este Processo Pode Demorar Vбrios Minutos."
CONVERT_CDROM_STAGE1_FAILED = "Erro: A Imagem BIN/CUE nгo Pode ser Convertida.%nPor Favor, Verifique se o Arquivo CUE Esta no Formato Correto."
CONVERT_CDROM_STAGE2_FAILED = "Erro: Uma imagem ISO Foi Criada A partir da Imagem BIN/CUE, Esta nгo Pode Ser Convertida.%nDeseja Preservar a Imagem ISO Para Futuras Anбlises?"
CONVERT_BIN_MISSING = "Erro: Nгo se Encontra Disponivel:%n%s\%s.%s%n%nAmbos %s.bin y %s.cue Sгo Necessarios."
INIT_COMPLETE = "Inicializaзгo %s. Por favor, Saia do Instalador e Depois Presione OK Para Continuar"
WISE_MSI_PROMPT = "Nota: Este Mйtodo sу Funciona Com Alguns Pacotes de Instalacгo Wise Para Windows.%nSe o Assistente do Instalador Wise Abrir й sу Esperar as Instrucхes, Este Arquivo nгo й%nSuportado. Por Favor, Feche o Instalador e %s Interrompa a Extraзгo.%n%nDeseja Continuar?"
UNPACK_PROMPT = "Este Arquivo Estб Comprimido com %s , Mas Pode ser Extraнdo.%nPode ser Porque o Formato nгo й Suportado, ou %n Simplismente Porque й um Arquivo nгo Incluнdo Para Extracгo.%n%nQuer Tentar Descompactar Este Arquivo?%n%nNota: O Arquivo Descompactado Deverб ser Denominado:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Erro: %s%nNгo Pode ser Descompactado."
WARN_EXECUTE = "Atenзгo:  Se Vocк Pedir Para Extrair Arquivos Deste Tipo, o Arquivo Sera Executado Atй Terminar.%nSe Vocк Continuar, o Seguinte Comando Serб Executado:%n%n%s%n%nSe Vocк Acha Este Arquivo Malicioso, й Recomendavel que Vocк Nгo Continue.%nDeseja Continuar Com a Extraзгo?"

; Help text
HELP_SUMMARY = "Extrair o Conteъdo de Qualquer Tipo de Arquivo ou Pacote de Instalacгo."
HELP_SYNTAX = "%nUso:  %s [/help] [nomearquivo [destino]]"
HELP_ARGUMENTS = "%n%nOpcхes Suportadas:"
HELP_HELP = "%n     /help%t%tMostrar a Informaзгo de Ajuda"
HELP_FILENAME = "%n     nome_do_arquivo%tNome_do_Arquivo_para_Extrair"
HELP_DESTINATION = "%n     Destino%tDiretorio_Destino"
HELP_SUB = "%n%nPassagem /sub em vez de Utilizar um Diretуrio de Destino%n%s Extrair o Arquivo em um Sub-diretуrio."
HELP_EXAMPLE1 = "%n%nExemplo:"
HELP_EXAMPLE2 = "%n     %s c:\1\exemplo.zip c:\test"
HELP_NOARGS = "%n%nExecutando %s sem dar Opзхes de Escolha %n ao Usuбrio de Nome do Arquivo e Diretуrio de Destino."

; Error messages
CANNOT_LOG = "%s a Extracгo nгo Pode ser Registrada."
CANNOT_DEBUG = "O Diretorio de Aquivo de Depuraзгo, "%s", Nгo Pode Ser Escrito.%nSua Pasta Temporaria Serб Usada."
CANNOT_EXTRACT = "%s nгo Pode ser Extraнdo.%nO Tipo de Arquivo Retornado й: %s%n%nClique OK se quer Analizar o Arquivo, ou Cancelar Para Finalizar."
UNKNOWN_EXT = "%s%nЙ uma Extenзгo Desconhecida e nгo Pode ser Extraнda."
INVALID_DIR = "%s%nnгo Pode ser Criado. Por Favor, Selecione um Destino Vбlido."
EXTRACT_FAILED = "%%s nгo Pode ser Extraнdo.%nParece ser um %s, que nгo й Suportado, a Extracгo Falhou.%nPor Favor, Para Maiores Informaзхs, Leia o Arquivo de Registro (log), %s.%n%nSelecione OK Para ver o Arquivo de Registro, ou Cancelar para Finalizar."

[Installer]
; Components page
COMP_DOCS = "Documentaзгo e Informaзхes de Licenзa"
COMP_LANG = "Arquivos de Traduзгo Para Suporte Internacional"
COMP_ACE = "Suporte Para Arquivos ACE"
COMP_KGB = "Suporte Para Arquivos KGB"
COMP_PEA = "Suporte Para Arquivos Pea"
COMP_SIT = "Suporte Para Arquivos StuffIt"

; Preferences page
PREFS_CAPTION = "Ajustar Opзхes Do Programa"
PREFS_DESCRIPTION = "Quais Opзхes do Universal Extractor Voзк Deseja Ativar?"
PREFS_LABEL1 = "Voзк Pode Definir as Seguintes Opзхes Para Ajustar o Comportamento do Universal Extractor."
PREFS_LABEL2 = "Estas Opзхes Podem ser Mudadas Depois de Instalaзгo Modificando o Arquivo UniExtract.ini."
LANGUAGE_LABEL = "Linguagem Atual"
DEBUG_LABEL = "Local do Arquivo de Depuraзгo"
APPEND_EXT_LABEL = "&Tentar Juntar Extensхes Perdidas de Arquivos"
HISTORY_LABEL = "&Manter o Histуrico de Arquivos"
REMOVE_DUPE_LABEL = "Eliminar &Arquivos Duplicados"
REMOVE_TEMP_LABEL = "Eliminar Arqui&vos Temporбrios"
WARN_EXECUTE_LABEL = "&Avisar Antes de Executar o Arquivo"

; Tasks page
ASSOCIATE = "&Habilitar a Integraзгo com Shell do Explorer"
ASSOCIATE_FILES = "Adicionar 'Extrair com UniExtract &Arquivos...' ao Menu Contexto"
ASSOCIATE_HERE = "Adicionar 'Extrair com UniExtract &Aquн' ao Menu Contexto"
ASSOCIATE_SUBDIR = "Adicionar 'Extrair com UniExtract no &Sub-diretуrio' ao Menu Contexto"
ASSOCIATE_FORCE = "Forзar a &Associaзгo com Todos os Formatos de Arquivos Suportados"
MODIFY_PATH = "Adicionar Universal Extractor ao &Path do Sistema"
DESKTOP_ICON = "Criar Нcone na &Бrea de Trabalho"
QUICK_LAUNCH_ICON = "Criar um Нcone na Barra de Inicializaзгo &Rбpida"

; Context Menu integration
EXTRACT_FILES = "Extrair com UniExtract &Arquivos..."
EXTRACT_HERE = "Extrair com UniExtract &Aqui"
EXTRACT_SUB = "Extrair com UniExtract no &Sub-diretуrio"
